goodix-ble/GR551x-MicroPython/ports/gr55xx/boards/gr5515/mpconfigboard.h
#ifndef __MP_CONFIG_BOARD_H__
#define __MP_CONFIG_BOARD_H__

#define MICROPY_HW_BOARD_NAME               "gr5515-sk"
#define MICROPY_HW_MCU_NAME                 "gr5515"
#define MICROPY_HW_BOARD_LED_HELP_TEXT      "1,2"

// GR5515-sk machine feature
#define MICROPY_PY_MACHINE_LED              (1u)

#endif /*__MP_CONFIG_BOARD_H__*/
